Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	//ЗаписьЖурналаРегистрации("Параметры сеанса. Установка параметров сеанса", УровеньЖурналаРегистрации.Информация, , , "");
	
	//если ТребуемыеПараметры = неопределено тогда
	//	УправлениеПользователямиСервер.ОбновитьСправочникПользователей();
	//конецесли;
	ПараметрыСеансаСервер.УстановитьПараметрыСеанса(ТребуемыеПараметры);
	
	//++ Никитчин М.В. 30.08.2016 {
	//Заполним параметры сеанса согласно доступам  по группам Active Directory
	//ПроверкаБезопасностиБезВызоваСервера_нов.УстановкаПараметровСеанса(ТребуемыеПараметры);
	//++} Никитчин М.В. 30.08.2016 
КонецПроцедуры
