&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Месяц = Формат(Объект.ПериодРегистрации, "ДФ='MMMM yyyy'");
    СформироватьСписокВыбораМесяца(Год(Объект.ПериодРегистрации));
	
КонецПроцедуры

Процедура СформироватьСписокВыбораМесяца(Год)
	
	Дата = ТекущаяДата();
	Год = (Год(Дата)); 
	
	Элементы.Месяц.СписокВыбора.Очистить();
    Элементы.Месяц.СписокВыбора.Добавить(Формат(Год-1, "ЧГ=0"));
	  
    Для к = 1 По 12  Цикл
        СформДата = Дата(Год, к, 1);
        Наим = Формат(СформДата, "ДФ = ММММ_гггг");
        Наим = СтрЗаменить(Наим, "_", " ");
        Элементы.Месяц.СписокВыбора.Добавить(Наим);    
    КонецЦикла; 
	
	Элементы.Месяц.СписокВыбора.Добавить(Формат(Год+1, "ЧГ=0"));
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцПриИзменении(Элемент)
	
	Если Элементы.Месяц <> "" Тогда
        Если СтрДлина(Элементы.Месяц)=4 Тогда 
            СформироватьСписокВыбораМесяца(Число(Элементы.Месяц));
            Объект.ПериодРегистрации = НачалоМесяца(Дата(Число(Элементы.Месяц), 1, 1));
            Месяц = Формат(Объект.ПериодРегистрации, "ДФ='MMMM yyyy'");
		Иначе
			
            НомМесяца = (Найти("янвфевмарапрмайиюниюлавгсеноктноядек",Нрег(Лев(Месяц,3)))+2)/3; //получаем номер месяца
            ВыбрГод = Число(Прав(Месяц, 4));
            Объект.ПериодРегистрации = НачалоМесяца(Дата(ВыбрГод, НомМесяца, 1));
        КонецЕсли;    
	КонецЕсли;
	
КонецПроцедуры

