

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьРеквизиты();
	УстановитьВидимость();
	ДоступностьТЧНарушенияУстранены();
	ДоступностьДатыПуска();
	//ЗаполнитьОтветственного();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидЖильяПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры


&НаКлиенте
Функция ДоступностьТЧНарушенияУстранены()
	
	//Если НЕ (ЗначениеЗаполнено(Нарушения)) Тогда
	//	ЭтаФорма.Элементы.ТабличнаяЧастьАдресНарушенияУстранены.Доступность = Ложь;
	//Иначе
	//	ЭтаФорма.Элементы.ТабличнаяЧастьАдресНарушенияУстранены.Доступность = Истина;
	//КонецЕсли;
	
КонецФункции

//Установить видимость реквизита дата пуска, если нарушения устранены
&НаКлиенте
Функция ДоступностьДатыПуска()
	
	Нарушения = Объект.Описание;
	
	Если НЕ (ЗначениеЗаполнено(Нарушения)) Тогда
		ЭтаФорма.Элементы.ДатаПуска.Доступность = Истина;
	Иначе
		ЭтаФорма.Элементы.ДатаПуска.Доступность = Ложь;
	КонецЕсли;
КонецФункции

//Установить видимость реквизитов в зависимости от вида жилья
&НаКлиенте
Функция УстановитьВидимость()
		ВидЖильяМногокв = Объект.ВидЖилья;
	
	Если НЕ ВидЖильяМногокв = ПредопределенноеЗначение("Перечисление.ВидыЖилья.Многоквартирный") Тогда
		ЭтаФорма.Элементы.ДомМногоквартирный.Видимость = Ложь;
		ЭтаФорма.Элементы.ТабличнаяЧастьАдресКорпус.Видимость = Ложь;
		ЭтаФорма.Элементы.ТабличнаяЧастьАдресДом.Видимость = Истина;
	Иначе
		ЭтаФорма.Элементы.ДомМногоквартирный.Видимость = Истина;
		ЭтаФорма.Элементы.ТабличнаяЧастьАдресДом.Видимость = Ложь;
		ЭтаФорма.Элементы.ТабличнаяЧастьАдресКорпус.Видимость = Истина;
	КонецЕсли;
	
КонецФункции

//Заполнить реквизит автор пользователем изменявшим документ
&НаСервере
Процедура ЗаполнитьОтветственного()
	Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры

//Заполнить реквизит адрес и ответственный
&НаСервере
Процедура ЗаполнитьРеквизиты()
	ВидЖильяМногокв = Объект.ВидЖилья;	
	АдресТЧ = "";
	РеквОписание = "";
	
	//Формирование части адреса и описания с ТЧ документа
	Для каждого ТекущаяСтрока Из Объект.ТабличнаяЧастьАдрес Цикл
		
		ТЧДом = ТекущаяСтрока.Дом;
		ТЧКорпус = ТекущаяСтрока.Корпус;	
		ТЧКвартира = ТекущаяСтрока.Квартира;
		ТЧНарушенияУстранены = ТекущаяСтрока.НарушенияУстранены;
		ТЧПричинаНевозобновления = ТекущаяСтрока.ПричинаНевозобновления;
		
		Если ВидЖильяМногокв = ПредопределенноеЗначение("Перечисление.ВидыЖилья.Многоквартирный") Тогда	
			Если НЕ (ЗначениеЗаполнено(ТЧКорпус)) Тогда
				ТекущаяСтрока.Дом = Объект.ДомМногоквартирный;
				АдресТЧ = АдресТЧ + ", "+ ТЧКвартира;
				
				
				Если (ЗначениеЗаполнено(ТЧПричинаНевозобновления)) Тогда
					Если ТЧНарушенияУстранены = Ложь Тогда
						РеквОписание = РеквОписание + "кв. " + ТЧКвартира + " - " + ТЧПричинаНевозобновления + Символы.ПС;
					КонецЕсли;
				КонецЕсли;
			Иначе 
				ТекущаяСтрока.Дом = Объект.ДомМногоквартирный;
				АдресТЧ = АдресТЧ + ", " + ТЧКорпус + "/" + ТЧКвартира;
				
				Если (ЗначениеЗаполнено(ТЧПричинаНевозобновления)) Тогда
					Если ТЧНарушенияУстранены = Ложь Тогда
						РеквОписание = РеквОписание +  "корп/кв. " + ТЧКорпус + "/" + ТЧКвартира + " - " + ТЧПричинаНевозобновления + Символы.ПС;
						КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если НЕ (ЗначениеЗаполнено(ТЧДом)) Тогда
				АдресТЧ = АдресТЧ + ", " + ТЧКвартира;
				
				Если (ЗначениеЗаполнено(ТЧПричинаНевозобновления)) Тогда
					Если ТЧНарушенияУстранены = Ложь Тогда
						РеквОписание = РеквОписание +  "кв. " + ТЧКвартира + " - " + ТЧПричинаНевозобновления + Символы.ПС;
						КонецЕсли;
				КонецЕсли;
			Иначе
				АдресТЧ = АдресТЧ + ", " + ТЧДом + "/" + ТЧКвартира;
				Если (ЗначениеЗаполнено(ТЧПричинаНевозобновления)) Тогда
					Если ТЧНарушенияУстранены = Ложь Тогда
						РеквОписание = РеквОписание +  "дом/кв. " + ТЧДом + "/" + ТЧКвартира + " - " + ТЧПричинаНевозобновления + Символы.ПС;
						КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	РеквНаселенныйПункт = Объект.НаселенныйПункт.Наименование;
	РеквНаселенныйПунктТип = Объект.НаселенныйПункт.ТипНаселенногоПункта.Наименование;
	РеквРайонГорода = Объект.РайонГорода.Наименование;
	РеквУлица = Объект.Улица.Наименование;
	РеквУлицаТип = Объект.Улица.ТипУлицы.НаименованиеКратное;
	РеквДомКв = Объект.ДомМногоквартирный;
	
	//Заполнение реквизита адрес для многоквартирных домов	
	Если ВидЖильяМногокв = ПредопределенноеЗначение("Перечисление.ВидыЖилья.Многоквартирный") Тогда
		Объект.Адрес = ?(НЕ ПустаяСтрока(РеквНаселенныйПункт), РеквНаселенныйПунктТип + " "
		+ РеквНаселенныйПункт , "") + ?(НЕ ПустаяСтрока(РеквРайонГорода),", " + РеквРайонГорода,"")
		+ ?(НЕ ПустаяСтрока(РеквУлица), ", " + РеквУлицаТип + " " + РеквУлица, "") 
		+ ?(НЕ ПустаяСтрока(РеквДомКв), ", буд. " + РеквДомКв + ", корп/кв " + АдресТЧ, "");
	//Заполнение реквизита адрес для ч/с	
	Иначе 
		Объект.Адрес = ?(НЕ ПустаяСтрока(РеквНаселенныйПункт), РеквНаселенныйПунктТип + " "
		+ РеквНаселенныйПункт , "") + ?(НЕ ПустаяСтрока(РеквРайонГорода),", " + РеквРайонГорода,"")
		+ ?(НЕ ПустаяСтрока(РеквУлица), ", " + РеквУлицаТип + " " + РеквУлица + ", буд/кв " + АдресТЧ, "");			
	КонецЕсли;
	
	Объект.Описание = РеквОписание;
	
КонецПроцедуры

&НаКлиенте
Процедура НаселенныйПунктПриИзменении(Элемент)
	ЗаполнитьРеквизиты();
КонецПроцедуры

&НаКлиенте
Процедура УлицаПриИзменении(Элемент)
	ЗаполнитьРеквизиты();
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ЗаполнитьРеквизиты();
	//Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьАдресПриИзменении(Элемент)
	ДоступностьТЧНарушенияУстранены();
	ЗаполнитьРеквизиты();
	ДоступностьДатыПуска();
КонецПроцедуры





















