
Процедура ПередЗаписью(Отказ, Замещение)
	перем Запись;
	
	если ОбменДанными.Загрузка тогда
		возврат;
	конецесли;
	
	для каждого Запись из ЭтотОбъект цикл
		если не УправлениеПользователямиСервер.ДоступноРедактированиеПользователя(Запись.Пользователь) тогда
			Сообщить("Запрещено редактирование настроек пользователя: " + Строка(Запись.Пользователь));
			Отказ = истина;
			возврат;
		конецесли;
	конеццикла;
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры
