//++ Seeges 03.07.2018 
Функция ПолучитьСсылкуКлассификатораПоТипуКонтрагента(Тип_Контрагента) Экспорт
	
	Если Тип_Контрагента = "1" Тогда
		Ссылка_Тип_Контрагента = ЮрЛицо;
	ИначеЕсли Тип_Контрагента = "2" Тогда
		Ссылка_Тип_Контрагента = ФизЛицо;
	ИначеЕсли Тип_Контрагента = "3" Тогда
		Ссылка_Тип_Контрагента = ИндивидуальныйПредприниматель;
	ИначеЕсли Тип_Контрагента = "4" Тогда
		Ссылка_Тип_Контрагента = ЮрЛицо; 
	ИначеЕсли Тип_Контрагента = "5" Тогда
		Ссылка_Тип_Контрагента = ОбъединенияГраждан;
	Иначе
		//Такого быть не должно
		
		Ссылка_Тип_Контрагента = Неопределено;
		
	КонецЕсли;
	
	Возврат Ссылка_Тип_Контрагента;

КонецФункции
