
&НаСервере
Процедура ПриОткрытииНаСервере()
	
	ОтборСписокВыбора = Новый СписокЗначений;
	Элементы.ОтборСписокВыбора.СписокВыбора.Добавить("Отключенные абоненты");
	Элементы.ОтборСписокВыбора.СписокВыбора.Добавить("Пуск произведен");
	Элементы.ОтборСписокВыбора.СписокВыбора.Добавить("Все документы");
	
	ОтборСписокЗначений = Элементы.ОтборСписокВыбора.СписокВыбора.Получить(0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПриОткрытииНаСервере();
	
КонецПроцедуры



