
// возвращает значение реквизита по имени
Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита) Экспорт
	возврат Ссылка[ИмяРеквизита];
КонецФункции
Функция ЗначениеРеквизитаОбъектаИлиРодителя(знач Ссылка, ИмяРеквизита) Экспорт
	перем Результат;
	
	УстановитьПривилегированныйРежим(истина);
	
	пока не ЗначениеЗаполнено(Ссылка[ИмяРеквизита]) и ЗначениеЗаполнено(Ссылка.Родитель) цикл
		Ссылка = Ссылка.Родитель;
	конеццикла;
	Результат = Ссылка[ИмяРеквизита];
	
	УстановитьПривилегированныйРежим(ложь);
	
	возврат Результат;
КонецФункции
Функция ЗначениеПодчиненногоРеквизита(знач Ссылка, знач ИмяРеквизита) Экспорт
	пока истина цикл
		Позиция = СтрНайти(ИмяРеквизита, ".");
		если Позиция = 0 тогда
			прервать;
		конецесли;
		Ссылка = Ссылка[Лев(ИмяРеквизита, Позиция - 1)];
		ИмяРеквизита = Сред(ИмяРеквизита, Позиция + 1);
	конеццикла;
	
	возврат Ссылка[ИмяРеквизита];
КонецФункции

// ищем ссылку на родителя первого уровня
Функция ВерхнийРодитель(знач Элемент) Экспорт
	пока ЗначениеЗаполнено(Элемент.Родитель) цикл
		Элемент = Элемент.Родитель;
	конеццикла;
	
	возврат Элемент;
КонецФункции

// возвращает значение перечисления по имени
Функция ЗначениеПеречисления(ИмяПеречисления, ИмяЗначения) Экспорт
	возврат Перечисления[ИмяПеречисления][ИмяЗначения];
КонецФункции
